'''
Задача 3:
Реализуйте функцию принимающую 2 аргумента - 2-е даты.
Результатом вычисления функции должна быть разница между 2-й датой и 1-й датов в днях.
В случае если разница принимает негативное значение вывести в консоль абсолютное значение разницы в днях.
Используем стандартный модуль Python для работы с датами datetime (без внешних библиотек).
'''

def sub_date(date1, date2):
    '''
    разница между 2-й датой и 1-й датой в днях
    :param date1: 1-я дата
    :param date2: 2-я дата
    :return: абсолютное значение разницы в днях
    '''
    return abs((date2 - date1).days)
